{
    "years": [
        {
            "year" : "1929",
            "text" : "Born in Bodji, Wallega Province, Ethiopia "
        },
{"year": "1939",
"text": "Begins to attend local evangelical school in Bodji (Accepts Christ, Cuts down Hommi Tree)"},

{"year": "43-47",
"text": "Attendance at Swedish Evangelical Mission school in Nedjo, Wallega. Serves as an interpreter for missionaries and a voluntary evangelist."
},

{"year": "1947",
"text": "Employment by the Swedish Evangelical Mission’s Teferi Mekonen Hospital in Nekemte, Wallega. Later, he participated in a training course for dressers."},

{"year": "1951",
"text": "Married his wife Adde Tsehay Tolessa in Nekemte"},

{"year": "1952",
 "text": "Graduated as advanced dresser from Teferi Mekonnen Hospital Nursing School."},

{"year": "52-55",
"text": "Employment by Swedish Evangelical Mission as Dresser in Nekemte, Bakko and Arjo"},
 
{"year": "52-55",
 "text": "Study in the second Pastoral course organized in Nedjo by the Swedish Evangelical Mission and the German Hermannsburg"},


{"year": "52-55",
 "text": "Attendance as youth delegate from Ethiopia at the All-African Lutheran Conference, Marangu, Taganika, East Africa"

},
 
 {
     "year":  "1958",
 "text": "Ordained as one of the pioneer national Pastors of the Evangelical congregation in Nekemte"
 },

 {"year":  "1962",
"text": "Conflict on a matter of Christian ethics with an influential member of the Nekemte congregation made the EECMY sned Gudina Tumsa on a short teaching assignment to the Kambata/Hadiya area"
},

{"year": "1963",
 "text": "Assignment to the Kambata/Hadiya area by the EECMY officers to organize the work of the Mekane Yesus Church their"
},

 {"year": "63-66",
 "text": "After the conflict in the Nekmete Church only one missionary sided with Gudina Tumsa, Later on this missionaries recommendation GT was given a scholarship to attend Theological studies at Luther- Northwestern Theological Seminary, St.Paul, Minnesota, USA. Receives Bachelor of Divinity degree"
},
{"year": "66-79",
 "text": "Serves as an Executive General Secretary of the EECMY with office in Addis Ababa"},
 
{"year": "1968",
"text": "Elected as the Chairman of the “Association of the Lutheran Congregation of Addis Ababa and Vicinity"},
 
{"year": "1970",
 "text": "Elected as a member of the policy and reference committee of the Assembly of the Lutheran World Federation at Evian (France) where he played a significant role by introducing an additional recommendation in the field of human rights"
},

 {"year": "1972",
 "text": "Leads a three-man drafting committee in the production of the controversial document entitled “On the Interrelation Between Proclamation of the Gospel and Human Development"},
 
{"year": "1973",
 "text": "Makes an official call on the government of Ethiopia to speed up work on land reform in the Ethiopian Parliament. (Letter to Imperial Government)"},

 {"year":  "1974",
"text": "Organizes the “Addis Ababa Synod” of the Mekane Yesus Church and becomes elected as the first President of the Synod"},

{"year": "1975",
 "text": "Initiates and takes a leading role in conducting seminars and workshops on Christianity and Socialism"},

 {"year":" 1976",
 "text": "Plays a leading role in the formation of the “Council for Cooperation of Churches in Ethiopia (CCCE)” and is elected Chairman"},



{"text": ",Second arrest",
"year": "1979"},


{"text": "Kidnapped and Murdered by Derg Regime burial of the grounds of the former estate of Ras Kassa, Addis Ababa",
"year": "1992"},

{"text": "Body found and reburial ceremony",
"year":"1992"}

 
    ]    
}









